var status_tooltips = { 
    'פרסום בעיתונות לתוקף' : 'התכנית כבר אושרה, והודעה על כך מפורסמת בעיתונות לפי החוק',
    'פרסום תוקף ברשומות' : 'התכנית כבר אושרה, והודעה על כך מפורסמת ברשומות הרשמיות לפי החוק',
    'אושר בועדת תאום לשיכונים ציבוריים' : 'אישור חלוקה מחדש של חלקות ובעלויות בשיכונים ציבוריים קיימים',
    'הוכרז שיכון ציבורי' : 'הסדרת חלקות ובעלויות של משתכני דיור ציבורי מסטטוס זמני לבעלות קבועה',
    'פרסום ההפקדה' : 'פרסום הפקדת התוכנית',
    'הוגשה למקומית' : 'התוכנית הוגשה לוועדה המקומית, אך עדיין לא פורסמה',
    'סעיפים 77 ו-78 לחוק תכנון ובניה' : 'פרסום הודעה על הכנת תכנית',
    'דיון בהתנגדויות' : 'הוועדה דנה בהתנגדויות שהוגשו',
    'הומלצה לאישור בועדה' : 'התכנית הומלצה לאישור לאחר דיון בהתנגדויות',
    'פרסום בעיתונות להפקדה' : 'התוכנית הופקדה בועדת התכנון, ופורסמה ידיעה בעיתון לפי חוק',
    'התוכנית נדחתה' : 'התוכנית נדחתה ע&quot;י הוועדה',
    'פרסום ביטול תוקף' : 'התוכנית בוטלה',
    'דיון מתן תוקף בועדת תכנון' : 'התוכנית נדונה בוועדה, כנראה לאחר שמיעת ההתנגדויות',
    'אושר לתוקף/ לא פורסם' : 'התוכנית כנראה אושרה, אך אישור עדיין לא פורסם',
    'בתהליך ביטול' : 'התכנית בתהליך ביטול',
    'תכנית גנוזה' : 'התכנית נגנזה',
    'תוקף ברשומות- באישור שר הפנים' : 'פרסום התוקף יבוצע בכפוף לאישור שר הפנים',
    'תכנית בהקפאה /התלייה' : 'התכנית הוקפאה בוועדה, בד&quot;כ בשל התנגשות עם תכנית אחרת',
    'הוגשה למחוזית' : 'התוכנית הוגשה לוועדה המחוזית',
    'פרסום ביטול הפקדה' : 'הפקדת התכנית בוטלה',
    //'סקרים' : '?',
    'טרום הפקדה' : 'שלב תכנוני לפני הפקדה',
    'בדיקת אפשרויות' : 'שלב תכנוני לפני הפקדה'
};

Handlebars.registerHelper('statusWithTooltip', function(status, options) {
    if (status in status_tooltips)
        return new Handlebars.SafeString('<p rel="tooltip" title="' + status_tooltips[status] + '">' + status + "</p>");
    else
        return new Handlebars.SafeString(status);
});
